read_verilog accelerator.v control.v mac.v relu.v systolic1.v systolic2.v wbmem.v 
synth_xilinx -top accelerator
write_verilog accelerator_synth.v
